from typing import Any

program_SQL = f'SQL/Oracle это 10 недель:\n' \
              f'1 - Связи в базах данных\n' \
              f'2 - Создание таблиц\n' \
              f'3 - DML и индексы\n' \
              f'4 - Запросы к нескольким таблицам\n' \
              f'5 - Условия для агрегатных функций\n' \
              f'6 - Промышленный запрос\n' \
              f'7 - Транзакции, представления\n' \
              f'8 - Операторы, циклы\n' \
              f'9 - Курсоры, хранимые процедуры\n' \
              f'10 - Триггеры, исключения'

modules_Python_AI = f'Анализ данных на Python это 7 модулей:\n' \
                    f'1 - Введение в Python\n' \
                    f'2 - Библиотеки Python\n' \
                    f'3 - ООП и паттерны \n' \
                    f'4 - Математика для Анализа данных \n' \
                    f'5 - Машинное обучение\n' \
                    f'6 - Нейронные сети\n' \
                    f'7 - Кейсы в портфолио '

program_Excel = f'Базовый Excel это 6 недель:\n' \
                f'1 - Структура документа Excel\n' \
                f'2 - Базовое форматирование и фильтры\n' \
                f'3 - Google таблицы и автозаполнение \n' \
                f'4 - Ссылки и основные функции\n' \
                f'5 - Продвинутые функции\n' \
                f'6 - ВПР, ГПР, индексы и практические задачи\n'

free_Python_base = 'https://youtu.be/znRUCEXVjfk'
